Repository: wildboar47/fcatsbot
Catalog: FCatsBot/Strings/strings.*.resx
Languages: fa, ru

# Author
source: Author: Ivan Koroteev. Using C# and PostgreSql and Google Cloud Vision neural networks.
fa: برنامه نویس و مولف ربات: ایوان کوروتیو، وی با استفاده از شبکه های عصبی #C و PostgreSql و گوگل کلود ویژن این ربات را تهیه کرده است.
ru: Автор: Иван Коротеев. Используется C# и PostgreSql и нейросети Google Cloud Vision.

# BigFile
source: File is bigger than 20 MB!
fa: این فایل بیش از 20MB حجم دارد!
ru: Файл больше 20 MB!

# Commands
source: Ok, my commands are
fa: بسیار خوب، فرمانهای من عبارتند از
ru: Вот мои команды:

# ContactMessage
source: Sorry, can not process ContactMessage
fa: ببخشید، قادر به پردازش پیامهای متنی نمی باشیم.
ru: Извини, тип ContactMessage не поддерживается

source: Description
fa: شرح
ru: Описание

# Echo
source: Not recognized.
fa: پیام تشخیص داده نشد.
ru: Не распознано.

# ErrorFile
source: Error while processing your {0}
fa: در هنگام پردازش {0} شما خطایی رخ داده است.
ru: Произошла ошибка при обработке типа {0}

# InlineText
source: inline cat
ru: котик

# Instructions
source: Press {0} and choose picture with cat in menu Gallery/Camera (Photo on desktop), up to 5 MB, and it will be sent to moderation using Google Cloud Vision. Or you can use /catapi command to send random cat from thecatapi.com to moderation. Also you can send to bot url to cat picture.
fa: {0} را فشرده و یک تصویر حاوی گربه تا حجم 5MB از منوی گالری/دوربین (تصاویر موجود در سیستم) وارد کنید. این تصویر با استفاده از گوگل کلود ویژن متعادل سازی می شود. یا اینکه میتوانید از فرمان /catapi استفاده کرده یک تصویر گربه تصادفی از thecatapi.com جهت متعادل سازی ارسال کنید. همچنین قادر هستید URL تصویر گربه را به این ربات ارسال نمایید.
ru: Нажми {0} и выбери фото с котиком в меню Gallery/Camera (File/Photo на десктопе), размером до 5 MB, и оно будет отправлено на модерацию с помощью Google Cloud Vision. Или используй команду /catapi для отправки на модерацию котика из thecatapi.com Также можешь прислать ссылку на картинку с котиком.

# LangChanged
source: Language set.
fa: تنظیمات بر اساس زبان فارسی انجام شد.
ru: Язык установлен.

# Location
source: Your location is Lat={0} Long={1}
ru: Твое местоположение: широта={0} долгота={1}

# NoUrls
source: no urls for you, sorry.
ru: для тебя нет сохраненных ссылок

# RateBot
source: Rate bot at https://telegram.me/storebot?start=fcatsbot
fa: به این ربات در https://telegram.me/storebot?start=fcatsbot امتیاز بدهید.
ru: Оцени бота по ссылке https://telegram.me/storebot?start=fcatsbot

# Registered
source: you are registered user
ru: вы зарегистрированный пользователь.

# SavedOnMega
source: photo sent to moderation using Google Cloud Vision
fa: تصویر جهت متعادل سازی با گوگل کلود ویژن ارسال شد.
ru: картинка принята на модерацию с помощью Google Cloud Vision.

# SavedPhoto
source: photo saved
fa: تصویر ذخیره شد.
ru: фото сохранено.

# Start
source: Ok, bot started. MAIN BOT COMMANDS: /vote - Vote for cats in our base! /catapi - add more cats to our base from thecatapi.com Send me your pictures with cats!
fa: بسیار خوب، ربات شروع به کار کرد. فرمانهای اصلی ربات: /vote - رای دادن به گربه ها در پایگاه ما /catapi - اضافه کردن گربه های بیشتر به پایگاه ما از thecatapi.com عکسهای خود با گربه ها را برای من ارسال کنید!
ru: Ок, бот работает. ГЛАВНЫЕ КОМАНДЫ БОТА: /vote - Голосуй за котиков в нашей базе! /catapi - Добавь еще больше котиков в базу с сайта thecatapi.com Можешь прислать мне свои картинки с котиками!

# TypeNotSupported
source: Sorry, type {0} not supported.
fa: با عرض پوزش از {0} پشتیبانی نمی شود.
ru: Извини, тип {0} не поддерживается

# WhyMega
source: Everyone likes cats!
fa: همه گربه ها را دوست دارند!
ru: ВСЕ ЛЮБЯТ КОТИКОВ

# YouHaveUrls
source: You have {0} urls
fa: همه گربه ها را دوست دارند!
ru: У вас есть {0} ссылок

# YourLatestUrl
source: Random Cat:
fa: تصویر تصادفی گربه:
ru: Случайный котик:

# GetHelp
source: Type /help for list of commands and language change.
fa: برای دستیابی به لیست فرمانها یا تغییر زبان /help را وارد کنید.
ru: Используй /help для получения списка команд и смены языка.

# CatCaption
source: Cat №{0}
fa: {0} گربه شماره
ru: Котик №{0}

# NoCatsFound
source: No cats found. Seems like you viewed every cat!
fa: پیام تشخیص داده نشد.
ru: Котиков не найдено. Похоже, ты всех посмотрел!

# Views
source: Views: {0}
fa: {0} تعداد بازدید
ru: Просмотров: {0}

# VoteFalse
source: You already voted for this cat
fa: شما قبلاً به این گربه رای داده اید.
ru: Вы уже голосовали за этого котика!

# CannotProcessUrl
source: Sorry, this urls is not processed. Send cat picture separately.
fa: با عرض پوزش این URL ها پردازش نمی شود. لطفا تصویر گربه را به صورت جداگانه ارسال فرمایید.
ru: Извини, эта ссылка не обработана. Пришли картинку с котиком отдельно.

# WatsonSay
source: Google Cloud Vision say this is {0} with {1} score
fa: پیام تشخیص داده نشد.
ru: Google Cloud Vision говорит что это {0} с {1} вероятностью

# ModManual
source: photo sent to manual moderation (limit of 250 pics per day reached)
fa: تصویر جهت متعادل سازی دستی ارسال شد. ( به حدنصاب 250 تصویر در روز رسیده ایم.)
ru: картинка принята на модерацию вручную (лимит 250 фото в день превышен)

# VoteMore
source: Continue voting - press
fa: پیام تشخیص داده نشد.
ru: Продолжить голосование - жми

# WatsonHasCat
source: Google Cloud Vision say there is cat on this picture! Moderation was successful. Here what was found:
fa: گوگل کلود ویژن گربه ای را در این تصویر تشخیص داده است! متعادل سازی موفقیت آمیز بود. آنچه یافت شد
ru: Google Cloud Vision говорит,что котик на этой картинке есть! Модерация успешна. Вот что он нашел:

# WatsonNoCat
source: Google Cloud Vision say there is NO cat on this picture! It will go to manual moderation. Here what was found:
fa: گوگل کلود ویژن هیچ گربه ای در این تصویر تشخیص نداده است! این تصویر جهت متعادل سازی دستی ارسال می شود. آنچه یافت شد:
ru: Google Cloud Vision говорит,что котика на этой картинке нет. Она будет модерироваться вручную. Вот что он нашел:

# LangSelect
source: fa3ew
fa: زبان فارسی
ru: faewf

# WatsonEmpty
source: nothing. Send another picture.
fa: هیچ چیز. تصویر دیگری با گربه ارسال فرمایید.
ru: ничего. Пришлите другую картинку.

# SpecialThanks
source: Special thanks to:
fa: با تشکر ویژه از:
ru: Особая благодарность:

# UrlNoJpg
source: Only urls with jpg or png files are accepted!
fa: تنها URL های با فایل JPG یا PNG قابل قبول می باشند!
ru: Принимаются ссылки только на jpg или png файлы!

source: Next
fa: بعدی
ru: Дальше

# CatFromApi
source: Cat from thecatapi.com
fa: گربه از thecatapi.com
ru: Котик из thecatapi.com

# CatFromUrl
source: Cat from your url
fa: گربه از URL شما
ru: Котик из вашей ссылки

# btnDonate
source: Donate $
fa: اهدای کمک مالی
ru: Помочь автору

# btnHelp
source: Options
fa: گزینه ها
ru: Настройки

# btnMore
source: add more cats
fa: اضافه کردن گربه
ru: добавить еще котиков

# btnVote
source: rate cats pics
fa: به تصاویر گربه ها امتیاز بدهید.
ru: заценить котиков
